# St7GetNumFactorsEnvelopeCases

Returns the number of cases (rows) included in the specified factors envelope for the currently open solution.

long St7GetNumFactorsEnvelopeCases(long uID, long Envelope, long* NumCases)

Input Parameters

uID

Strand7 model file ID.

Envelope

Factors envelope number.

Output Parameters
NumCases

Number of cases in the envelope.